8bitgeek/caribou-rtos/caribou-rtos/caribou/3rdparty/CycloneTCP_CycloneSSL_CycloneCrypto_Open_1_4_2/demo/ti/dk_tm4c129x/ftp_client_demo/keil/startup_tm4c129x.s
;/**************************************************************************//**
; * @file     startup_TM4C129.s
; * @brief    CMSIS Cortex-M4 Core Device Startup File for
; *           TI Tiva TM4C129 Snowflake Class Device
; * @version  V1.00
; * @date     15. May 2013
; *
; * @note
; * Copyright (C) 2011 ARM Limited. All rights reserved.
; *
; * @par
; * ARM Limited (ARM) is supplying this software for use with Cortex-M
; * processor based microcontrollers.  This file can be freely distributed
; * within development tools that are supporting such ARM based processors.
; *
; * @par
; * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
; * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
; * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
; * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
; * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
; *
; ******************************************************************************/
;/*
;//-------- <<< Use Configuration Wizard in Context Menu >>> ------------------
;*/


; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x00000400

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

;Heap_Size       EQU     0x00000000

;                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
;__heap_base
;Heap_Mem        SPACE   Heap_Size
;__heap_limit


                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset

                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp              ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler
                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts

                DCD     GPIOA_Handler             ;   0: GPIO Port A
                DCD     GPIOB_Handler             ;   1: GPIO Port B
                DCD     GPIOC_Handler             ;   2: GPIO Port C
                DCD     GPIOD_Handler             ;   3: GPIO Port D
                DCD     GPIOE_Handler             ;   4: GPIO Port E
                DCD     UART0_Handler             ;   5: UART0 Rx and Tx
                DCD     UART1_Handler             ;   6: UART1 Rx and Tx
                DCD     SSI0_Handler              ;   7: SSI0 Rx and Tx
                DCD     I2C0_Handler              ;   8: I2C0 Master and Slave
                DCD     PMW0_FAULT_Handler        ;   9: PWM Fault
                DCD     PWM0_0_Handler            ;  10: PWM Generator 0
                DCD     PWM0_1_Handler            ;  11: PWM Generator 1
                DCD     PWM0_2_Handler            ;  12: PWM Generator 2
                DCD     QEI0_Handler              ;  13: Quadrature Encoder 0
                DCD     ADC0SS0_Handler           ;  14: ADC Sequence 0
                DCD     ADC0SS1_Handler           ;  15: ADC Sequence 1
                DCD     ADC0SS2_Handler           ;  16: ADC Sequence 2
                DCD     ADC0SS3_Handler           ;  17: ADC Sequence 3
                DCD     WDT0_Handler              ;  18: Watchdog timer
                DCD     TIMER0A_Handler           ;  19: Timer 0 subtimer A
                DCD     TIMER0B_Handler           ;  20: Timer 0 subtimer B
                DCD     TIMER1A_Handler           ;  21: Timer 1 subtimer A
                DCD     TIMER1B_Handler           ;  22: Timer 1 subtimer B
                DCD     TIMER2A_Handler           ;  23: Timer 2 subtimer A
                DCD     TIMER2B_Handler           ;  24: Timer 2 subtimer B
                DCD     COMP0_Handler             ;  25: Analog Comparator 0
                DCD     COMP1_Handler             ;  26: Analog Comparator 1
                DCD     COMP2_Handler             ;  27: Analog Comparator 2
                DCD     SYSCTL_Handler            ;  28: System Control (PLL, OSC, BO)
                DCD     FLASH_Handler             ;  29: FLASH Control
                DCD     GPIOF_Handler             ;  30: GPIO Port F
                DCD     GPIOG_Handler             ;  31: GPIO Port G
                DCD     GPIOH_Handler             ;  32: GPIO Port H
                DCD     UART2_Handler             ;  33: UART2 Rx and Tx
                DCD     SSI1_Handler              ;  34: SSI1 Rx and Tx
                DCD     TIMER3A_Handler           ;  35: Timer 3 subtimer A
                DCD     TIMER3B_Handler           ;  36: Timer 3 subtimer B
                DCD     I2C1_Handler              ;  37: I2C1 Master and Slave                    
                DCD     CAN0_Handler              ;  38: CAN0
                DCD     CAN1_Handler              ;  39: CAN1
                DCD     EMAC0_Handler             ;  40: EMAC0
                DCD     HIB_Handler               ;  41: Hibernate
                DCD     USB0_Handler              ;  42: USB0
                DCD     PWM0_3_Handler            ;  43: PWM Generator 3
                DCD     UDMA_Handler              ;  44: uDMA Software Transfer
                DCD     UDMAERR_Handler           ;  45: uDMA Error
                DCD     ADC1SS0_Handler           ;  46: ADC1 Sequence 0
                DCD     ADC1SS1_Handler           ;  47: ADC1 Sequence 1
                DCD     ADC1SS2_Handler           ;  48: ADC1 Sequence 2
                DCD     ADC1SS3_Handler           ;  49: ADC1 Sequence 3
                DCD     EBI0_Handler              ;  50: External Bus Interface 0
                DCD     GPIOJ_Handler             ;  51: GPIO Port J
                DCD     GPIOK_Handler             ;  52: GPIO Port K
                DCD     GPIOL_Handler             ;  53: GPIO Port L
                DCD     SSI2_Handler              ;  54: SSI2 Rx and Tx
                DCD     SSI3_Handler              ;  55: SSI3 Rx and Tx
                DCD     UART3_Handler             ;  56: UART3 Rx and Tx
                DCD     UART4_Handler             ;  57: UART4 Rx and Tx
                DCD     UART5_Handler             ;  58: UART5 Rx and Tx
                DCD     UART6_Handler             ;  59: UART6 Rx and Tx
                DCD     UART7_Handler             ;  60: UART7 Rx and Tx
                DCD     I2C2_Handler              ;  61: I2C2 Master and Slave
                DCD     I2C3_Handler              ;  62: I2C3 Master and Slave
                DCD     TIMER4A_Handler           ;  63: Timer 4 subtimer A
                DCD     TIMER4B_Handler           ;  64: Timer 4 subtimer B
                DCD     TIMER5A_Handler           ;  65: Timer 5 subtimer A
                DCD     TIMER5B_Handler           ;  66: Timer 5 subtimer B
                DCD     FPU_Handler               ;  67: FPU
                DCD     0                         ;  68: Reserved
                DCD     0                         ;  69: Reserved
                DCD     I2C4_Handler              ;  70: I2C4 Master and Slave
                DCD     I2C5_Handler              ;  71: I2C5 Master and Slave
                DCD     GPIOM_Handler             ;  72: GPIO Port M
                DCD     GPION_Handler             ;  73: GPIO Port N
                DCD     0                         ;  74: Reserved
                DCD     TAMPER_Handler            ;  75: Tamper
                DCD     GPIOP0_Handler            ;  76: GPIO Port P (Summary or P0)
                DCD     GPIOP1_Handler            ;  77: GPIO Port P1
                DCD     GPIOP2_Handler            ;  78: GPIO Port P2
                DCD     GPIOP3_Handler            ;  79: GPIO Port P3
                DCD     GPIOP4_Handler            ;  80: GPIO Port P4
                DCD     GPIOP5_Handler            ;  81: GPIO Port P5
                DCD     GPIOP6_Handler            ;  82: GPIO Port P6
                DCD     GPIOP7_Handler            ;  83: GPIO Port P7
                DCD     GPIOQ0_Handler            ;  84: GPIO Port Q (Summary or Q0)
                DCD     GPIOQ1_Handler            ;  85: GPIO Port Q1
                DCD     GPIOQ2_Handler            ;  86: GPIO Port Q2
                DCD     GPIOQ3_Handler            ;  87: GPIO Port Q3
                DCD     GPIOQ4_Handler            ;  88: GPIO Port Q4
                DCD     GPIOQ5_Handler            ;  89: GPIO Port Q5
                DCD     GPIOQ6_Handler            ;  90: GPIO Port Q6
                DCD     GPIOQ7_Handler            ;  91: GPIO Port Q7
                DCD     GPIOR_Handler             ;  92: GPIO Port R
                DCD     GPIOS_Handler             ;  93: GPIO Port S
                DCD     SHAMD5_Handler            ;  94: SHA/MD5 0
                DCD     AES_Handler               ;  95: AES 0
                DCD     DES3DES_Handler           ;  96: DES3DES 0
                DCD     LCDCONTROLLER_Handler     ;  97: LCD Controller 0
                DCD     TIMER6A_Handler           ;  98: Timer 6 subtimer A
                DCD     TIMER6B_Handler           ;  99: Timer 6 subtimer B
                DCD     TIMER7A_Handler           ; 100: Timer 7 subtimer A
                DCD     TIMER7B_Handler           ; 101: Timer 7 subtimer B
                DCD     I2C6_Handler              ; 102: I2C6 Master and Slave
                DCD     I2C7_Handler              ; 103: I2C7 Master and Slave
                DCD     HIMSCANKEYBOARD_Handler   ; 104: HIM Scan Matrix Keyboard 0
                DCD     ONEWIRE_Handler           ; 105: One Wire 0
                DCD     HIMPS2_Handler            ; 106: HIM PS/2 0
                DCD     HIMLEDSEQUENCER_Handler   ; 107: HIM LED Sequencer 0
                DCD     HIMCONSUMERIR_Handler     ; 108: HIM Consumer IR 0
                DCD     I2C8_Handler              ; 109: I2C8 Master and Slave
                DCD     I2C9_Handler              ; 110: I2C9 Master and Slave
                DCD     GPIOT_Handler             ; 111: GPIO Port T

__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY


